# Срезы ver.2.

# Дана строка, в которой хранятся первые семь букв английского алфавита. 
# alphabet = 'abcdefg'
# Программа выводит на экран десять вот таких результатов:
# Копию строки.
# Элементы строки в обратном порядке.
# Каждый второй элемент строки (включая самый первый).
# Каждый второй элемент строки после первого.
# Все элементы до второго.
# Все элементы начиная с конца до предпоследнего.
# Все элементы в диапазоне индексов от 3 до 4 (не включая 4).
# Последние три элемента строки.
# Все элементы в диапазоне индексов от 3 до 4.
# То же, что и в предыдущем пункте, но в обратном порядке.

alphabet = 'abcdefg'
print(alphabet) 
print(alphabet[::-1])  
print(alphabet[::2])  
print(alphabet[1::2])  
print(alphabet[:1])  
print(alphabet[-1:-2:-1])
print(alphabet[3:4])  
print(alphabet[-3:])  
print(alphabet[3:5])  
print(alphabet[4:2:-1])
